#카페 키오스크

print('***대전대 카페***')
print('커피메뉴')
print('-------------------------------------------------------------------')
print('1. 아메리카노(HOT)(1500)  2. 아메리카노(ICE)(2000)  3. 카페라떼(3000)  4. 선택안함')
print('-------------------------------------------------------------------')
print('사이드메뉴')
print('-------------------------------------------------------------------')
print('1. 조각케잌(4500)  2. 크롱지(3000)  3. 선택안함')
print('--------------------------------------------------------------------')

#변수 선언
coffeMenu, sideMenu, price1, price2, tot = 0, 0, 0, 0, 0
coffe_menu_name = ['아메리카노(HOT)', '아메리카노(ICE)', '카페라떼', '선택안함']
side_menu_name = ['조각케잌', '크롱지', '선택안함']
coffeMenu = int(input('커피메뉴를 선택하세요(1~3) : '))
sideMenu = int(input('사이드메뉴를 선택하세요(1~2) : '))

#주메뉴 가격 결정
if coffeMenu == 1:
    price1 = 1500
elif coffeMenu == 2:
    price1 = 2000
elif coffeMenu == 3:
    price1 = 3000
elif coffeMenu == 4:
    price1 = 0
else:
    print('잘못 선택했습니다')

#사이드메뉴 가격 결정
if sideMenu == 1:
    price2 = 4500
elif sideMenu == 2:
    price2 = 3000
elif sideMenu == 3:
    price2 = 0
else:
    print('잘못 선택했습니다')

#총 가격 계산
tot = price1 + price2
print('-------------------------------------------------------------------')
print('총 가격:', tot, '원')
print('주문하신 커피메뉴는', coffe_menu_name[coffeMenu-1], '입니다')
print('주문하신 사이드메뉴는', side_menu_name[sideMenu-1], '입니다')
print('-------------------------------------------------------------------')